{"EAN": "9781848827417                  ", "abstract": "Although it is popularly assumed that the history of computing before the second half of the 20th century was unimportant, in fact the Industrial Revolution was made possible and even sustained by a parallel revolution in computing technology. An examination and historiographical assessment of key developments helps to show how the era of modern electronic computing proceeded from a continual computing revolution that had arisen during the mechanical and the electrical ages.This unique volume introduces the history of computing during the “first” (steam) and “second” (electricity) segments of the Industrial Revolution, revealing how this history was pivotal to the emergence of electronic computing and what many historians see as signifying a shift to a post-industrial society. It delves into critical developments before the electronic era, focusing on those of the mechanical era (from the emergence of the steam engine to that of the electric power network) and the electrical era (from the emergence of the electric power network to that of electronic computing). In so doing, it provides due attention to the demarcations between—and associated classifications of—artifacts for calculation during these respective eras. In turn, it emphasizes the history of comparisons between these artifacts.Topics and Features:motivates exposition through a firm historiographical argument of important developmentsexplores the history of the slide rule and its use in the context of electrificationexamines the roles of analyzers, graphs, and a whole range of computing artifacts hitherto placed under the allegedly inferior class of analog computersshows how the analog and the digital are really inseparable, with perceptions thereof depending on either a full or a restricted view of the computing processinvestigates socially situated comparisons of computing history, including the effects of a political economy of computing  (one that takes into account cost and ownership of computing artifacts)assesses concealment of analog-machine labor through encasement (“black-boxing”)Historians of computing, as well as those of technology and science (especially, energy), will find this well-argued and presented history of calculation and computation in the mechanical and electrical eras an indispensable resource.  The work is a natural textbook companion for history of computing courses, and will also appeal to the broader readership of curious computer scientists and engineers, as well as those who generally just have a yearn to learn the contextual background to the current digital age.\"In this fascinating, original work, Tympas indispensably intertwines the histories of analog and digital computing, showing them to be inseparable from the evolution of social and economic conditions. \" Prof. David Mindell, MIT", "Titel": "Calculation and Computation in the Pre-electronic Era : The Mechanical and Electrical Ages / Aristotelis Tympas                  ", "lang": "eng"}{"EAN": "9781484228715                  ", "abstract": "Carry out a variety of advanced statistical analyses including generalized additive models, mixed effects models, multiple imputation, machine learning, and missing data techniques using R. Each chapter starts with conceptual background information about the techniques, includes multiple examples using R to achieve results, and concludes with a case study.Written by Matt and Joshua F. Wiley, Advanced R Statistical Programming and Data Models shows you how to conduct data analysis using the popular R language. You’ll delve into the preconditions or hypothesis for various statistical tests and techniques and work through concrete examples using R for a variety of these next-level analytics.  This is a must-have guide and reference on using and programming with the R language.  What You’ll LearnConduct advanced analyses in R including: generalized linear models, generalized additive models, mixed effects models, machine learning, and parallel processingCarry out regression modeling using R data visualization, linear and advanced regression, additive models, survival / time to event analysisHandle machine learning using R including parallel processing, dimension reduction, and feature selection and classificationAddress missing data using multiple imputation in RWork on factor analysis, generalized linear mixed models, and modeling intraindividual variability Who This Book Is For Working professionals, researchers, or students who are familiar with R and basic statistical techniques such as linear regression and who want to learn how to use R to perform more advanced analytics. Particularly, researchers and data analysts in the social sciences may benefit from these techniques. Additionally, analysts who need parallel processing to speed up analytics are given proven code to reduce time to result(s).", "Titel": "Advanced R Statistical Programming and Data Models / Matt Wiley, Joshua F. Wiley                  ", "lang": "eng"}{"EAN": "9783319741192                  ", "abstract": "This book presents a new, innovative cloud federation solution called Federation-as-a-Service (FaaS) and its software platform, SUNFISH. The authors explain the various engineering innovations involved, with a particular emphasis on the architectural level, and the contributions examine state-of-the-art state cloud technologies and advanced blockchain-empowered solutions for enhanced security and reliability.The book will be of value to public sector solution providers, public sector decision-makers, cloud computing technologists, and those engaged with blockchain technology.", "Titel": "Federation-as-a-Service : A Cloud Federation Solution for the Public Sector                  ", "lang": "eng"}{"EAN": "9783319735306                  ", "abstract": "Text analytics is a field that lies on the interface of information retrieval,machine learning, and natural language processing, and this textbook carefully covers a coherently organized framework drawn from these intersecting topics. The chapters of this textbook is organized into three categories:- Basic algorithms: Chapters 1 through 7 discuss the classical algorithms for machine learning from text such as preprocessing, similarity computation, topic modeling, matrix factorization, clustering, classification, regression, and ensemble analysis.- Domain-sensitive mining: Chapters 8 and 9 discuss the learning methods from text when combined with different domains such as multimedia and the Web. The problem of information retrieval and Web search is also discussed in the context of its relationship with ranking and machine learning methods. - Sequence-centric mining: Chapters 10 through 14 discuss various sequence-centric and natural language applications, such as feature engineering, neural language models, deep learning, text summarization, information extraction, opinion mining, text segmentation, and event detection. This textbook covers machine learning topics for text in detail. Since the coverage is extensive,multiple courses can be offered from the same book, depending on course level. Even though the presentation is text-centric, Chapters 3 to 7 cover machine learning algorithms that are often used indomains beyond text data. Therefore, the book can be used to offer courses not just in text analytics but also from the broader perspective of machine learning (with text as a backdrop). This textbook targets graduate students in computer science, as well as researchers, professors, and industrial practitioners working in these related fields. This textbook is accompanied with a solution manual for classroom teaching.", "Titel": "Machine Learning for Text / Charu C. Aggarwal                  ", "lang": "eng"}{"EAN": "9783319728223                  ", "abstract": "This book constitutes the proceedings of the First International Conference on 5G for Future Wireless Networks, 5GWN 2017, held in Beijing, China, in April 2017. The 64 full papers were selected from 135 submissions and present the state of the art and practical applications of 5G technologies. The exponentially growing data traffic caused by the development of mobile Internet and smart phones requires powerful networks. The fifth generation (5G) techniques are promising to meet the requirements of this explosive data traffic in future mobile communications.", "Titel": "5G for Future Wireless Networks : First International Conference, 5GWN 2017, Beijing, China, April 21-23, 2017, Proceedings                  ", "lang": "eng"}{"EAN": "9783319706528                  ", "abstract": "It is well-established that while cognitive psychology provides a sound foundation for an understanding of our interactions with digital technology, this is no longer sufficient to make sense of how we use and experience the personal, relational and ubiquitous technologies that pervade everyday life. This book begins with a consideration of the nature of experience itself, and the user experience (UX) of digital technology in particular, offering a new, broader definition of the term. This is elaborated though a wide-ranging and rigorous review of what are argued to be the three core UX elements. These are involvement, including shared sense making, familiarity, appropriation and “being-with” technologies; affect, including emotions with and about technology, impressions, feelings and mood; and aesthetics, including embodied aesthetics and neuroaesthetics. Alongside this, new insights are introduced into how and why much of our current use of digital technology is simply idling, or killing time.A particular feature of the book is a thorough treatment of parallel, and sometimes competing, accounts from differing academic traditions. Overall, the discussion considers both foundational and more recent theoretical and applied perspectives from social psychology, evolutionary psychology, folk psychology, neuroaesthetics, neuropsychology, the philosophy of technology, design and the fine arts.  This broad scope will be enlightening and stimulating for anyone concerned in understanding UX. A Psychology of User Experience stands as a companion text to the author’s HCI Redux text which discusses the contemporary treatment of cognition in human-computer interaction.", "Titel": "A Psychology of User Experience : Involvement, Affect and Aesthetics / P. Turner                  ", "lang": "eng"}{"EAN": "9783319748955                  ", "abstract": "This book constitutes the refereed post-conference proceedings of the 4th International Workshop on Accelerator Programming Using Directives, WACCPD 2017, held in Denver, CO, USA, in November 2017.The 9 full papers presented have been carefully reviewed and selected from 14 submissions. The papers share knowledge and experiences to program emerging complex parallel computing systems. They are organized in the following three sections: applications; environments; and program evaluation.", "Titel": "Accelerator Programming Using Directives : 4th International Workshop, WACCPD 2017, Denver, CO, USA, November 13, 2017, Proceedings                  ", "lang": "eng"}{"EAN": "9781484230985                  ", "abstract": "Proactively plan and manage innovation in your business while keeping operations safe and secure. This book provides a framework and practices to help you safeguard customer information, prevent unauthorized access, and protect your brand and assets.Securing company operations is a board-level discussion. Across all industries, companies are pouring millions of dollars into taming cybercrime and other related security crime. Achieving and Sustaining Secured Business Operations presents a holistic approach looking top down, bottom up, and sideways. The end goal is to achieve and sustain a safe environment to conduct secured business operations while continuously innovating for competitive advantage.What You’ll LearnDiscover why security, specifically secured business operations, needs to be part of business planning and oversight by design and not left to technologists to make the business caseDetermine what you can do in your role and in your organization to drive and implement integration and improvements in planning and managing secured business operations in conjunction with other business planning and management activitiesChoose ways in which progress toward achieving and sustaining secured business operations can be measuredUnderstand best practices for organizing, planning, architecting, governing, monitoring, and managing secured business operationsCreate a framework, including methods and tools for operationalizing assessment, planning, and ongoing management of secured business operationsUse cases and potential case studies for various industries and business models            Who This Book Is For  Chief executive officers and their leadership team; chief operations officers; chief information officers and their leadership team; chief information security officers; business functional middle managers; and enterprise, solution, and information technology architects", "Titel": "Achieving and Sustaining Secure Business Operations : An Executive’s Guide to Planning and Management / Neelesh Ajmani, Dinesh Kumar                  ", "lang": "eng"}